{"pageProps":{"post":{"content":"\n\n### Amazon embraces the mighty monolith\n\n<img src=\"/images/step-functions.webp\" alt=\"image alt text\" style=\"width: 50%; float: left; padding: 5px;\" />\n\nIn March 2023, Amazon published a [blog post](https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90)\n, detailing how they had managed to reduce the cost of their audio-video monitoring service by 90%.\nThe _key_ to this reduction was migrating from a distributed, microservice architecture to a _monolith_.\nThe blog post went viral, prompting some software industry celebrities to \n[question](https://world.hey.com/dhh/even-amazon-can-t-make-sense-of-serverless-or-microservices-59625580) the entire concept of microservices.\n\n### What should we learn from this?\n\nSo, does this mean microservices are fundamentally flawed? Should we all migrate back to monoliths?\n_No_ and _definitely no_ I would say. Instead, my takeaways from this article are:\n\n1.  **Microservices aren't about scaling for performance.** At least not primarily. Although horizontally scalability for computationally intensive operations _can_ be very useful or even essential in some cases, it tends to be a rare benefit. Very often, performance bottlenecks are IO bound and caused by external systems beyond your control. Nevertheless, there _are_ other compelling reasons to consider microservices: they _force_ you to communicate via contracts, _encourage_ you to organize your functionality around domains, and _allow_ you to scale your organization. Of course, all this comes at considerable costs. There's no [free lunch 👇](#presentation).\n2.  <iframe width=\"372\" height=\"208\" src=\"https://www.youtube.com/embed/RC_FHNRI8Lg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen style=\"float: right; padding: 5px;\"></iframe> <b>Don't underestimate the power of a single CPU in 2023</b>. To judge whether a process is unreasonably slow or not, I tend to think of the fact that already in the 1990s, screens showed 65K pixels at any given time. Back then, multiple arithmetic calculations (additions, subtractions) could be performed for each pixel, fifty times per second. Nowadays, your screen probably displays more than 5 Million pixels at once. So, if the amount of datapoints you are dealing with in the order of millions, you should generally be able to process them in a matter of seconds on a single machine. If you can't, you may be doing something <i>very</i> inefficient.\n3.  **Software engineering is hard**. Mistakes are made all the time, everywhere. Even at the big 4 tech companies. Kudos to Amazon 👏 for openly sharing the mistake they made so that we may all learn.\nIn the next section we will share one of our own experiences, not entirely different from the Amazon example.\n\n### The 90% cost reduction case at Vandebron\n\n#### Microservices or just distributed computing?\nConsidering that all the functionality used in the Amazon case all belongs to the same _domain_, it's arguably not even \na case against improper use of microservices, but instead an example of misuse of *distributed computing*. <br/>\nAt Vandebron we've had a similar experience, which I will share below.\n\n#### Predicting the production of electricity\nFor utility companies, accurately predicting both electricity consumption and production is crucial.\nFailing to do so can result in blackouts or overproduction, both of which are [very costly](https://vandebron.nl/blog/hoe-houdt-onze-technologie-het-energienet-in-balans).\nVandebron is a unique utility company in that the electricity that our customers consume is produced by a [very large\namount](https://vandebron.nl/energiebronnen) of relatively small scale producers, who produce electricity using windmills or solar panels.\nThe large number and the weather dependent nature of these producers make it very hard to predict electricity generation accurately.\n\nTo do this, we use a machine learning model that is trained on historical production data \nand predictions from the national weather [institute](https://www.knmi.nl/). As you can imagine, this is a computationally intensive task, involving large amounts of data.\nFortunately, we have [tooling in place](https://www.vandebron.tech/blog/fueling-the-energy-transition-with-spark-part-1) that\nallows us to distribute computations of a cluster of machines if the task is too large for a single machine to handle.\n\nHowever, here's the catch: the fact that we _can_ distribute computations does not mean that we should. Initially it seemed that\nwe couldn't analyze the weather data quick enough for the estimation of our production to still be a _prediction_\nrather than a _postdiction_. We decided to distribute the computation of the weather data over a cluster of machines.\nThis worked, but it made our software more complex and Jeff Bezos even richer than he already was.\n\nUpon closer inspection, we found an extreme inefficiency in our code. It turned out that we were repeatedly reading the entire weather dataset\ninto memory, for _every_ single \"pixel\". After removing this performance bug, the entire analysis could _easily_ be done\non a single machine. \n\n### What more is there to say? <a id=\"presentation\"> </a>\n\n\nSo if microservices aren't about performance, what _are_ they about? If I had to sum it up in one sentence It would be:\n> _Microservices are a way to scale your organization_\n\nThere is a lot of detail hiding in that sentence, which I can't unpack in the scope of this article. If you're interested\nwhat microservices have meant for us, I would recommend you watch the presentation below.\n\n\n#### Microservices at Vandebron\nAt [Vandebron](https://vandebron.nl/), we jumped onto the \"microservice bandwagon\" circa 2019. This wasn't a decision\nmade on a whim. We had seen a few industry trends come and go, so we first [read up](https://samnewman.io/books/building_microservices_2nd_edition/)\nand did our own analysis. We found that the concept of microservices held promise, but also knew that they would come at a cost.\n\nThese are some of the dangers we identified and what we did to mitigate them.\n\n| **Danger**                                | **Mitigation**                                                                                                              |\n|-------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------|\n| _A stagnating architecture_               | Compile and unit-test time detection of breaking changes                                                                    |\n| _Complicated and error prone deployments_ | Modular CI/CD [pipelines](https://github.com/Vandebron/mpyl)                                                                |\n| _Team siloization_                        | A single repository (AKA monorepo) for all microservices and a discussion platform for cross-domain and cross-team concerns |\n| _Duplication of code_                     | Shared in house libraries for common functionality                                                                          |\n\n\n\nThe following presentation to the students of [VU University, Amsterdam](https://vu.nl/) explains how we implemented\nsome of these mitigations and what we learned from them.\n\n[![Presentation about micro services to students of VU Amsterdam](/images/play_presentation.webp)](https://youtu.be/HDs-pCsEzKM)\n","meta":{"title":"So, back to the monolith it is then?","description":"A recent Amazon article explaining how they managed to save costs by merging some of their services has lead some to question the value of microservices. What is our take?","createdAt":"Sat May 20 2023 08:00:00 GMT+0800 (Central Indonesia Time)","coverImage":"images/monolith.webp","tags":"dagster, cicd, ci-cd, orchestration, data pipeline, kubernetes, migration, helm, ansible","author":"Sam Theisens","slug":"blog/back-to-the-monolith","formattedDate":"20 mei 2023","date":"Sat May 20 2023 08:00:00 GMT+0800 (Central Indonesia Time)"}}},"__N_SSG":true}