{"pageProps":{"post":{"content":"\nIn our sustainable journey at Vandebron, we are not only striving to revolutionize the renewable energy sector, but we are also rethinking how we interact with technology ourselves. As a part of this initiative, we have been looking at how to reduce our digital footprint. One of our most recent projects involves transforming our ageing fleet of iMacs into revitalized, lightweight machines. \n\nWe proudly introduce the 'flexMac'.\n\n### Regained speed, sustainability and enhanced security\nOur customer contact department, the core of our operation, was equipped with older iMacs running on slower HDD drives. While replacing these machines with newer models might have been the easier route, it didn't align with our commitment to sustainability. \n\nInstead, we decided to be creative and look for ways to upcycle our older iMacs. Our choice of tool? Google's ChromeOS Flex. As the slogan suggests, [‘don’t bin it, just flex it’](https://www.linkedin.com/feed/update/urn:li:activity:7066377989831233536/) we figured this could very well meet our wishes. By installing this onto our iMacs, we have given birth to our new line of workstations, naming them 'flexMacs'.\n\n[ChromeOS Flex](https://chromeenterprise.google/os/chromeosflex/) is a free, open-source operating system by Google that breathes [new life into older PCs and Macs](https://cloud.google.com/blog/products/chrome-enterprise/chromeos-flex-ready-to-scale-to-pcs-and-macs). It's lightweight, fast, and ideal for the web-centric applications and services our customer contact department uses every day. Once ChromeOS Flex was installed, the transformation was remarkable. The old machines metamorphosed from very slow to production-ready again in a breath, adept at handling all our workflows at the Customer Contact department.\n\nThese workflows at Customer Contact are fully web-based. It enables us multichannel support, integration capabilities, and data-driven insights. These help our support agents to provide personalized and efficient service across various communication channels. By using these technologies and insights, we optimize our customer service strategies, leading (hopefully) to higher customer satisfaction.\n\nAnother important benefit of this transformation was an added layer of security. ChromeOS Flex allows our users to log in using their Google identity, ensuring a personalized and secure workspace for every team member. This means each user experiences a secure, tailored environment, whilst bringing an additional level of security and control to our IT operations.\n\n### The importance of circularity\nBesides the operational benefits, the broader environmental impact of this initiative is important to us. By extending the life of our technology, we contribute directly to reducing e-waste, one of [the fastest-growing waste streams in the EU](https://www.europarl.europa.eu/news/en/headlines/society/20201208STO93325/e-waste-in-the-eu-facts-and-figures-infographic). As a company, Vandebron is not only promoting sustainable innovations but striving to actively embody them. Our 'flexMacs project is a testament to this commitment.\n\nOur 'flexMacs' project demonstrates how we can repurpose and upgrade older hardware, which according to Emerce is a [hot thing to do](https://www.emerce.nl/achtergrond/circulaire-hardware-is-hot-dit-is-waarom). We hope this blogpost inspires you to consider similar sustainability initiatives. By choosing to upgrade rather than replace, we extend the life of existing hardware and contribute to a reduction in e-waste.\n\nStay tuned for more updates from our tech-driven sustainability journey.\n","meta":{"title":"Sustainable Tech-Hardware - Introducing the 'flexMac'","description":"Enhanced security, sustainability, and regained speed at Customer Contact revitalizing our old iMacs.","createdAt":"Mon Jul 03 2023 02:00:00 GMT+0200 (Central European Summer Time)","coverImage":"images/circular.jpeg","tags":"sustainable-tech, flexmac, circularity","author":"Gehdrio Lake & Sietse Bruinsma","slug":"blog/sustainable-tech-hardware","formattedDate":"3 juli 2023","date":"Mon Jul 03 2023 02:00:00 GMT+0200 (Central European Summer Time)"}}},"__N_SSG":true}