{"pageProps":{"post":{"content":"\n# Grid City: A Hackathon Journey into the Energy Transition by Vandebron\n\nDuring the last couple of hackathons, we set out to gamify one of the most pressing challenges of our time, the transition to green energy.\nA problem our team, VPP [Virtual Power Plant], deals with on a daily basis.\nWhat emerged was an interactive game designed to educate players about the complexities of energy grid management in a fun and manageable way, \nthough debatable if it is fun or well-balanced. It was a hackathon project after all.\n\n<video playsInLine autoplay muted loop style=\"max-width: 100%; height: auto;\">\n  <source src=\"../images/game-start-h265.mp4\" type=\"video/mp4\">\n  Your browser does not support the video tag.\n</video>\n\nLet’s dive into the vision, mechanics, and what we hope players take away from this experience.\n\n### Vision: Educate Through Play\nOur goal was to create more than just a game. We envisioned a tool that serves as an onboarding experience, \nnot just for our colleagues, but also anyone interested in the energy transition.\n\nTo realize this vision we chose to go with Godot as our game engine of choice. \nAn open-source game engine that is a super fun and fantastic tool that allowed us to quickly prototype and iterate on our ideas and feedback.\n\n### The Core Gameplay Loop: Keeping the Grid Balanced\nIn this game, your primary goal is to keep the energy grid frequency within the \"goldilocks zone\", i.e. not too much power production, not too little. \nThe longer you can maintain this balance, the better!\n\n#### Key Concepts:\n- **Keeping within the goldilocks zone:** energy production must match energy demand. Fall outside the goldilocks zone, and the grid becomes unstable. If it is unstable for too long, then it's game over.\n- **Keeping up with demand:** Houses are automatically built over time, mimicking real-life construction. It’s up to the player to meet this increasing demand by manually adding renewable energy assets, like wind turbines, solar panels, and batteries.\n- **Forecasting:** Players can use weather forecasts to anticipate and plan for energy production challenges. Too much wind? Better disable some wind turbines for the time being.\n- **Curtailment:** Too much energy? Players must decide when to turn off assets to avoid overproduction. This introduces the concept of curtailment and highlights the work often required in grid management, due to not being able to store the excess energy.\n- **The Main Goal:** A 100% Green Energy Grid, 100% of the time.\n\nWhat does success look like in the game? Maintaining the grid with 100% green power for as long as possible, via strategically managing energy production and curtailment to ensure sustainability.\nPlayers experience the dual challenge of meeting growing energy demands and avoiding excess production, a dilemma central to real-world energy grids.\n\n### Final Thoughts\n\nWhile we did meet most of these goals, we definitely see room for improvement. \nFor instance, the city building aspect of the game does not exactly match what we want to teach the player. A Virtual Power Plant mainly balances the grid through smart curtailment. \nIt doesn't involve building new renewables. So we considered removing the building mechanic from the game, but we were already to deep into development.\n\nTo work around this design issue, we toyed with the idea of having a coal plant in the game, amongst others. \nThe goal was to shut down the coal plant before it fully pollutes the planet. \nAfter shutdown, players face the challenge of balancing the grid reliably using just renewable energy. \nUnfortunately, we ran out of time before we could fine-tune this part of the game.\n\n<video playsInLine autoplay muted loop controls style=\"max-width: 100%; height: auto;\">\n  <source src=\"../images/coal-plant-prototype.mp4\" type=\"video/mp4\">\n  Your browser does not support the video tag.\n</video>\n\n*Here's an early prototype of the coal plant that didn't make it in to the game.*\n\nAt some point, though, you have to wrap up the hackathon. So we polished what we had and declared the game \"done\". \nWhether you’re a gamer, an energy enthusiast, or someone entirely new to the topic, we hope this game sparks your interest in the energy transition :)\n\nYou can play the game right from your browser [here](https://djvisser.itch.io/grid-city)!\nIf you want to take a look at the (hackathon-quality) code, check out our [public repo](https://github.com/Vandebron/vandebron_game).\n\n","meta":{"title":"Grid City: A Hackathon Journey into the Energy Transition by Vandebron","description":"A journey into the energy transition through the lens of a video game","createdAt":"Tue Jan 21 2025 00:00:00 GMT+0000 (Coordinated Universal Time)","coverImage":"images/game-start-screen.png","tags":["godot","energy transition","gaming"],"author":"Dick Visser & Tomás Phelan","slug":"blog/vandebron-the-video-game","formattedDate":"21 januari 2025","date":"Tue Jan 21 2025 00:00:00 GMT+0000 (Coordinated Universal Time)"}}},"__N_SSG":true}