{"pageProps":{"post":{"content":"\n# Vandebron The Video Game: A Hackathon Journey into the Energy Transition\n\nDuring a recent hackathon, we set out to gamify one of the most pressing challenges of our time: the transition to green energy.\nA problem our team, VPP [Virtual Power Plant], deal with on a daily basis.\nWhat emerged was an interactive game designed to educate players about the complexities of energy grid management in a fun and manageable way, \nthough debatable if it is fun or well-balanced, was a hackathon after all.\n\n<video controls width=\"640\" height=\"360\">\n  <source src=\"../images/game-start.mp4\" type=\"video/mp4\">\n  Your browser does not support the video tag.\n</video>\n\nLet’s dive into the vision, mechanics, and what we hope players take away from this experience.\n\n### Vision: Educate Through Play\nOur goal was to create more than just a game. We envisioned a tool that serves as an onboarding experience, \nnot just for our colleagues, but also anyone interested in the energy transition.\n\nTo realize this vision we chose to go with Godot as our game engine of choice. \nAn open-source game engine that is a super fun and fantastic tool that allowed us to quickly prototype and iterate on our game mechanics.\n\n### The Core Gameplay Loop: Keeping the Grid Balanced\nIn this game, your primary goal is to maintain the energy grid within the \"goldilocks zone\" not too much power, not too little. The longer you can achieve this, the better!\n\n#### Key Concepts:\n- Keeping within the goldilocks zone, energy in must match energy out. Fall outside the goldilocks zone, and the grid becomes unstable. If it is unstable for too long, then it's game over.\n- Keeping up with demand: Houses are automatically built over time, mimicking real-life construction. It’s up to the player to manually add renewable energy assets, like wind turbines, solar panels, and batteries, to continue to meet demand.\n- Forecasting: Players can use forecasts to anticipate and plan for energy production challenges.\n- Curtailment: Too much energy? Players must decide when to turn off assets to avoid overproduction. This introduces the concept of curtailment and highlights the work often required in grid management, due to not being able to store the excess energy.\n- The Main Goal: A 100% Green Energy Grid, 100% of the time.\n\nWhat does success look like in the game? Maintaining the grid with 100% green power for as long as possible, via strategically managing energy production and curtailment to ensure sustainability.\nPlayers experience the dual challenge of meeting growing energy demands and avoiding excess production, a dilemma central to real-world energy grids.\n\nWhether you’re a gamer, an energy enthusiast, or someone entirely new to the topic, we hope this game sparks your interest in the energy transition :) ","meta":{"title":"Vandebron The Video Game: A Hackathon Journey into the Energy Transition","description":"A journey into the energy transition through the lens of a video game","createdAt":"Tue Jan 21 2025 00:00:00 GMT+0000 (Coordinated Universal Time)","coverImage":"images/game-start-screen.png","tags":["godot","energy transition","gaming"],"author":"Dick Visser & Tomás Phelan","slug":"blog/vandebron-the-video-game","formattedDate":"21 januari 2025","date":"Tue Jan 21 2025 00:00:00 GMT+0000 (Coordinated Universal Time)"}}},"__N_SSG":true}