{"pageProps":{"post":{"content":"\nIn our sustainable journey at Vandebron, we are not only striving to revolutionize the renewable energy sector, but we are also rethinking how we interact with technology ourselves. As a part of this initiative, we have been looking at how to reduce our digital footprint. One of our most recent projects involves transforming our ageing fleet of iMacs into revitalized, lightweight machines. \n\nWe proudly introduce to you the 'FlexMac'.\n\n### Regained speed, sustainability and enhanced security\nOur customer contact department, the core of our operation, was equipped with older iMacs running on slower HDD drives. While replacing these machines with newer models might have been the easier route, it didn't align with our commitment to sustainability. \n\nInstead, we decided to be creative. Our choice of tool? Google's ChromeOS Flex. As the slogan suggests, ‘don’t bin it, just flex it’ we figured this could very well meet our wishes. By installing this onto our iMacs, we have given birth to our new line of workstations, naming them 'FlexMacs'.\n\nChromeOS Flex is a free, open-source operating system by Google that breathes new life into older PCs and Macs. It's lightweight, fast, and ideal for the web-centric applications and services our customer contact department uses every day. Once ChromeOS Flex was installed, the transformation was extraordinary. Our iMacs metamorphosed from slow to production-ready machines again in a breath, adept at handling our workflows at Customer Contact.\n\nThese workflows at the Customer Contact department are fully web-based. Working fully web-based in customer contact offers numerous benefits. Web-based customer care offers multichannel support, integration capabilities, and data-driven insights. These enable our representatives to provide personalized and efficient support across various communication channels. By leveraging technology and insights, we can optimize our customer service strategies, leading to improved customer satisfaction and loyalty.\n\nAnother important benefit of this transformation was an added layer of security. ChromeOS Flex allows our users to log in using their Google identity, ensuring a personalized and secure workspace for every team member. This means each user experiences a secure, tailored environment, bringing an additional level of security and control to our IT operations.\n\n### Circularity & next steps\nBesides the operational benefits, the broader environmental impact of this initiative is important to us. By extending the life of our technology, we contribute directly to reducing e-waste, one of the fastest-growing waste streams in the EU. As a company, Vandebron is not only promoting sustainable innovations but striving to actively embody them. Our 'FlexMacs project is a testament to this commitment.\n\nOur fleet of 'FlexMacs' demonstrates how we can repurpose and upgrade older hardware. We hope our blog inspires you to consider similar sustainability initiatives. By choosing to upgrade rather than replace, we extend the life of existing hardware and contribute to a reduction in e-waste.\n\nStay tuned for more updates from our tech-driven sustainability journey.","meta":{"title":"Sustainable Tech-Hardware - Introducing the 'FlexMac'","description":"enhanced security, sustainability, and regained speed at Customer Contact while being sustainable and circular","createdAt":"Mon Jul 03 2023 00:00:00 GMT+0000 (Coordinated Universal Time)","coverImage":"images/circular.jpeg","tags":"sustainable-tech, flexmac, circularity","author":"Gehdrio Lake & Sietse Bruinsma","slug":"blog/sustainable-tech-hardware","formattedDate":"3 juli 2023","date":"Mon Jul 03 2023 00:00:00 GMT+0000 (Coordinated Universal Time)"}}},"__N_SSG":true}